Revit 2027 API
ParameterTypeId.LightingFixtureLamp Property
 "Lamp"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId LightingFixtureLamp { get; }
Public Shared ReadOnly Property LightingFixtureLamp As ForgeTypeId
	Get
public:
static property ForgeTypeId^ LightingFixtureLamp {
	ForgeTypeId^ get ();
}
static member LightingFixtureLamp : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace